{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_7", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_target"}, "registered_name": null, "name": "input_target", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_context"}, "registered_name": null, "name": "input_context", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 971, "output_dim": 50, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["input_target", 0, 0]}}], "kwargs": {}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["input_context", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 50]}, "name": "flatten_14", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 50], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_15", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 50]}, "name": "flatten_15", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 50], "dtype": "float32", "keras_history": ["embedding", 1, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dot", "config": {"name": "dot_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "axes": 1, "normalize": false}, "registered_name": null, "build_config": {"input_shape": [[null, 50], [null, 50]]}, "name": "dot_7", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 50], "dtype": "float32", "keras_history": ["flatten_14", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 50], "dtype": "float32", "keras_history": ["flatten_15", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "input_features"}, "registered_name": null, "name": "input_features", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 1], [null, 19]]}, "name": "concatenate_7", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["dot_7", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 19], "dtype": "float32", "keras_history": ["input_features", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 20]}, "name": "dense_38", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 20], "dtype": "float32", "keras_history": ["concatenate_7", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 138042233857760}, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_39", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_38", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_target", 0, 0], ["input_context", 0, 0], ["input_features", 0, 0]], "output_layers": [["dense_39", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.007943456992506981, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}